package dsa.graph;

/**
 * TODO 使用邻接矩阵来表示图
 *      假设图有n个顶点,那么可以使用一个二维的 n×n矩阵 来表示边
 *      矩阵中的每一个元素或者为0或者为1
 *          如果从顶点i到顶点j存在一条边,那么adjacency[i][j]为1
 *          否则,adjacency[i][j]为0
 *      如果图是无向的,那么该矩阵是对称的,因为 adjacency[i][j] = adjacency[j][i]
 *
 *
 * @author kepler
 * @date 2023-08-13 15:37
 */
public class AdjacencyMatrix {
    public static void main(String[] args) {
        int[][] adjacencyMatrix1 = {
                {0,1,0,1,0,1,0,0,0,0,0,0},
                {1,0,1,1,0,0,0,0,0,0,0,0},
                {0,1,0,1,1,1,0,0,0,0,0,0},
                {1,1,1,0,1,1,0,0,0,0,0,0},
                {0,0,1,1,0,1,0,1,1,0,1,0},
                {1,0,0,1,1,0,1,1,0,0,0,0},
                {0,0,0,0,0,1,0,1,0,0,0,0},
                {0,0,0,0,1,1,1,0,1,0,0,0},
                {0,0,0,1,1,0,0,1,0,1,1,1},
                {0,0,0,0,0,0,0,0,1,0,0,1},
                {0,0,1,0,1,0,0,0,1,0,0,1},
                {0,0,0,0,0,0,0,0,1,1,1,0}
        };

        int[][] adjacencyMatrix2 = {
                {0,0,1,0,0},
                {0,0,1,0,0},
                {0,0,0,0,1},
                {0,0,0,0,1},
                {0,0,0,0,0}
        };
    }
}
